## 10.1 Introducing the Datasets

In [1]:
import pandas as pd

In [2]:
pd.read_csv("meetup/members1.csv").head()

   member_id       member_name           city state
0          3       Matt Meeker       New York    NY
1          6   Scott Heiferman       New York    NY
2         36        Mark Hurst       New York    NY
3         65  Brad Fitzpatrick  San Francisco    CA
4         82     Maggie Nelson  San Francisco    CA

In [3]:
pd.read_csv("meetup/members2.csv").head()

   member_id              member_name      city state
0  134851222                 Meghan D   Chicago    IL
1  134851522           Caitlin Martin  New York    NY
2  134851802     Jaleesa Stringfellow  New York    NY
3  134852292  Elisabete Melo Coutinho  New York    NY
4  134852562               Dana Veach   Chicago    IL

In [4]:
members1 = pd.read_csv("meetup/members1.csv")
members2 = pd.read_csv("meetup/members2.csv")

In [5]:
categories = pd.read_csv("meetup/categories.csv")
categories.head()

   category_id            category_name
0            1           Arts & Culture
1            2        Career & Business
2            3       Cars & Motorcycles
3            4  Community & Environment
4            5                  Dancing

In [6]:
cities = pd.read_csv("meetup/cities.csv")
cities.head()

   city_id            city state    zip
0     7093   West New York    NJ   7093
1    10001        New York    NY  10001
2    13417  New York Mills    NY  13417
3    46312    East Chicago    IN  46312
4    56567  New York Mills    MN  56567

In [7]:
groups = pd.read_csv("meetup/groups.csv")
groups.head()

   group_id                     group_name  category_id  city_id  organizer_id
0      6388         Alternative Health NYC           14    10001       1513133
1      6510      Alternative Energy Meetup            4    10001       3955940
2      8458              NYC Animal Rights           26    10001       1809940
3      8940  The New York City Anime Group           29    10001       2548151
4     10104             NYC Pit Bull Group           26    10001       1929168

In [8]:
events1 = pd.read_csv("meetup/events1.csv")
events1.head()

    event_id                                         event_name  group_id
0  153868222  Murder Mystery Dinner Crawl. Dine at 3 Restaur...   5817262
1  184167702  Friday Night Drinks with International Travele...   1627081
2  215200502            Dinner, Comedy, 100 Beers & Debauchery!   1627081
3  220826782                                Friday Night Drinks   5817262
4  227948102  AUSTRALIA DAY PARTY & Sausage Sizzle! $3 Beer/...   1627081

In [9]:
events2 = pd.read_csv("meetup/events2.csv")
events2.head()

       event_id                                         event_name  group_id
0  jrxkxlyxmbgc  NYC Creative and Business Professionals Networ...  10048442
1  jrxkxlyxnbdc  NYC Creative and Business Professionals Networ...  10048442
2  jsgfxlywqbhc  NYC Creative and Business Professionals Networ...   1576097
3  jsgfxlyxcbdc  NYC Creative and Business Professionals Networ...   1576097
4  jsgfxlyxdbjc  NYC Creative and Business Professionals Networ...   1576097

## 10.2 Concatenating the Datasets

In [10]:
pd.concat(objs = [members1, members2])

        member_id       member_name           city state
0               3       Matt Meeker       New York    NY
1               6   Scott Heiferman       New York    NY
2              36        Mark Hurst       New York    NY
3              65  Brad Fitzpatrick  San Francisco    CA
4              82     Maggie Nelson  San Francisco    CA
...           ...               ...            ...   ...
587918  240845614             Priya       New York    NY
587919  240845866       Eric Seaman       New York    NY
587920  240846998     Janeille Pita       New York    NY
587921  240849026           HU Yang       New York    NY
587922  240852081       James Weitz       New York    NY

[1087923 rows x 4 columns]

In [11]:
len(members1)

500000

In [12]:
len(members2)

587923

In [13]:
pd.concat(objs = [members1, members2], ignore_index = True)

         member_id       member_name           city state
0                3       Matt Meeker       New York    NY
1                6   Scott Heiferman       New York    NY
2               36        Mark Hurst       New York    NY
3               65  Brad Fitzpatrick  San Francisco    CA
4               82     Maggie Nelson  San Francisco    CA
...            ...               ...            ...   ...
1087918  240845614             Priya       New York    NY
1087919  240845866       Eric Seaman       New York    NY
1087920  240846998     Janeille Pita       New York    NY
1087921  240849026           HU Yang       New York    NY
1087922  240852081       James Weitz       New York    NY

[1087923 rows x 4 columns]

In [14]:
pd.concat(objs = [members1, members2], keys = ["A", "B"])

          member_id       member_name           city state
A 0               3       Matt Meeker       New York    NY
  1               6   Scott Heiferman       New York    NY
  2              36        Mark Hurst       New York    NY
  3              65  Brad Fitzpatrick  San Francisco    CA
  4              82     Maggie Nelson  San Francisco    CA
...             ...               ...            ...   ...
B 587918  240845614             Priya       New York    NY
  587919  240845866       Eric Seaman       New York    NY
  587920  240846998     Janeille Pita       New York    NY
  587921  240849026           HU Yang       New York    NY
  587922  240852081       James Weitz       New York    NY

[1087923 rows x 4 columns]

### 10.2.1 Missing Values in Merged DataFrames

In [15]:
data_A = [
    ["Marie Curie", "Svante Arrhenius"],
    ["Lord Rayleigh", "William Ramsay"]
]

nobel_winners_A = pd.DataFrame(
    data = data_A,
    columns = ["Physics", "Chemistry"],
    index = [1903, 1904]
)

nobel_winners_A

            Physics         Chemistry
1903    Marie Curie  Svante Arrhenius
1904  Lord Rayleigh    William Ramsay

In [16]:
data_B = [
    ["William Ramsay", "Ivan Pavlov"],
    ["Adolf van Baeyer", "Robert Koch"]
]

nobel_winners_B = pd.DataFrame(
    data = data_B,
    columns = ["Chemistry", "Medicine"],
    index = [1904, 1905]
)

nobel_winners_B

             Chemistry     Medicine
1904    William Ramsay  Ivan Pavlov
1905  Adolf van Baeyer  Robert Koch

In [17]:
pd.concat(objs = [nobel_winners_A, nobel_winners_B])

            Physics         Chemistry     Medicine
1903    Marie Curie  Svante Arrhenius          NaN
1904  Lord Rayleigh    William Ramsay          NaN
1904            NaN    William Ramsay  Ivan Pavlov
1905            NaN  Adolf van Baeyer  Robert Koch

In [18]:
# The two lines below are equivalent
pd.concat(
    objs = [nobel_winners_A, nobel_winners_B],
    axis = 1
)

pd.concat(
    objs = [nobel_winners_A, nobel_winners_B],
    axis = "columns"
)

            Physics         Chemistry         Chemistry     Medicine
1903    Marie Curie  Svante Arrhenius               NaN          NaN
1904  Lord Rayleigh    William Ramsay    William Ramsay  Ivan Pavlov
1905            NaN               NaN  Adolf van Baeyer  Robert Koch

In [19]:
data_C = [
    ["Frederic Mistral", "Institut de Droit International"],
    ["Henryk Sienkiewicz", "Bertha von Suttner"]
]

nobel_winners_C = pd.DataFrame(
    data = data_C,
    columns = ["Literature", "Peace"],
    index = [1904, 1905]
)

nobel_winners_C

              Literature                            Peace
1904    Frederic Mistral  Institut de Droit International
1905  Henryk Sienkiewicz               Bertha von Suttner

In [20]:
nobel_winners_A

            Physics         Chemistry
1903    Marie Curie  Svante Arrhenius
1904  Lord Rayleigh    William Ramsay

In [21]:
pd.concat(objs = [nobel_winners_A, nobel_winners_C])

,Physics,Chemistry,Literature,Peace
1903,Marie Curie,Svante Arrhenius,NaN,NaN
1904,Lord Rayleigh,William Ramsay,NaN,NaN
1904,NaN,NaN,Frederic Mistral,Institut de Droit International
1905,NaN,NaN,Henryk Sienkiewicz,Bertha von Suttner

## 10.3 Inner Joins

In [22]:
events1.tail(3)

,event_id,event_name,group_id
2497,jrxkxlyxjbhc,NYC Creative and Business Professionals Networ...,10048442
2498,jrxkxlyxkbfc,NYC Creative and Business Professionals Networ...,10048442
2499,jrxkxlyxlbkc,NYC Creative and Business Professionals Networ...,10048442

In [23]:
events2.tail(3)

          event_id                        event_name  group_id
3304  zzsxdlyxlbbc  Chicago Realtor Mastermind Group  18278889
3305  zzsxdlyxmbwb  Chicago Realtor Mastermind Group  18278889
3306  zzsxdlyxnbtb  Chicago Realtor Mastermind Group  18278889

In [24]:
events1.merge(
    right = events2, how = "inner", on = "group_id"
).head()

,event_id_x,event_name_x,group_id,event_id_y,event_name_y
0,153868222,Murder Mystery Dinner Crawl. Dine at 3 Restaur...,5817262,qrwlqhytcbcc,Drinks with International Travelers
1,220826782,Friday Night Drinks,5817262,qrwlqhytcbcc,Drinks with International Travelers
2,227967930,AUSTRALIA DAY PARTY & Sausage Sizzle! $3 Beer/...,5817262,qrwlqhytcbcc,Drinks with International Travelers
3,230034070,"Dinner, Comedy Show, 100 Beers & Debauchery!",5817262,qrwlqhytcbcc,Drinks with International Travelers
4,184167702,Friday Night Drinks with International Travele...,1627081,kjmpllytpbfb,Murder Mystery Restaurant Crawl!

In [25]:
events1[events1["group_id"] == 5817262]

    event_id                                         event_name  group_id
0  153868222  Murder Mystery Dinner Crawl. Dine at 3 Restaur...   5817262
3  220826782                                Friday Night Drinks   5817262
5  227967930  AUSTRALIA DAY PARTY & Sausage Sizzle! $3 Beer/...   5817262
6  230034070       Dinner, Comedy Show, 100 Beers & Debauchery!   5817262

In [26]:
events2[events2["group_id"] == 5817262]

          event_id                           event_name  group_id
1419  qrwlqhytcbcc  Drinks with International Travelers   5817262

In [27]:
events1.merge(
    right = events2, 
    how = "inner",
    on = "group_id",
    suffixes = ["_M1", " _M2"]
).head()

,event_id_M1,event_name_M1,group_id,event_id _M2,event_name _M2
0,153868222,Murder Mystery Dinner Crawl. Dine at 3 Restaur...,5817262,qrwlqhytcbcc,Drinks with International Travelers
1,220826782,Friday Night Drinks,5817262,qrwlqhytcbcc,Drinks with International Travelers
2,227967930,AUSTRALIA DAY PARTY & Sausage Sizzle! $3 Beer/...,5817262,qrwlqhytcbcc,Drinks with International Travelers
3,230034070,"Dinner, Comedy Show, 100 Beers & Debauchery!",5817262,qrwlqhytcbcc,Drinks with International Travelers
4,184167702,Friday Night Drinks with International Travele...,1627081,kjmpllytpbfb,Murder Mystery Restaurant Crawl!

In [28]:
events1.merge(
    right = events2,
    how = "inner",
    on = ["group_id", "event_name"],
    suffixes = [" Month 1", " Month 2"]
).head()

  event_id Month 1   event_name  group_id event_id Month 2
0        244352434  Story Time!   8726642     rhmtpnywnblc
1        244352434  Story Time!   8726642     rhmtpnywpbgb
2        244352434  Story Time!   8726642     rhmtpnywpbhc
3        244352434  Story Time!   8726642     rhmtpnywqbdb
4        244352434  Story Time!   8726642     rhmtpnywqbfc

## 10.4 Outer Joins

In [29]:
events1.merge(
    right = events2, how = "outer", on = "group_id"
).head()

,event_id_x,event_name_x,group_id,event_id_y,event_name_y
0,153868222,Murder Mystery Dinner Crawl. Dine at 3 Restaur...,5817262,qrwlqhytcbcc,Drinks with International Travelers
1,220826782,Friday Night Drinks,5817262,qrwlqhytcbcc,Drinks with International Travelers
2,227967930,AUSTRALIA DAY PARTY & Sausage Sizzle! $3 Beer/...,5817262,qrwlqhytcbcc,Drinks with International Travelers
3,230034070,"Dinner, Comedy Show, 100 Beers & Debauchery!",5817262,qrwlqhytcbcc,Drinks with International Travelers
4,184167702,Friday Night Drinks with International Travele...,1627081,kjmpllytpbfb,Murder Mystery Restaurant Crawl!

In [30]:
events1.merge(
    right = events2, how = "outer", on = "group_id"
).tail()

,event_id_x,event_name_x,group_id,event_id_y,event_name_y
281052,NaN,NaN,18278889,zzsxdlyxjbxb,Chicago Realtor Mastermind Group
281053,NaN,NaN,18278889,zzsxdlyxkbvb,Chicago Realtor Mastermind Group
281054,NaN,NaN,18278889,zzsxdlyxlbbc,Chicago Realtor Mastermind Group
281055,NaN,NaN,18278889,zzsxdlyxmbwb,Chicago Realtor Mastermind Group
281056,NaN,NaN,18278889,zzsxdlyxnbtb,Chicago Realtor Mastermind Group

In [31]:
events1.merge(
    right = events2, how = "outer", on = "group_id"
).iloc[8:13]

,event_id_x,event_name_x,group_id,event_id_y,event_name_y
8,233755101,The Founding Moms Exchange: Chicago,1415286,NaN,NaN
9,241206928,The Founding Moms' Exchange: Chicago,1415286,NaN,NaN
10,241206937,The Founding Moms' Exchange: Chicago,1415286,NaN,NaN
11,243650743,The Founding Moms' Exchange: Chicago!,1415286,NaN,NaN
12,244483624,The Founding Moms' Exchange: Chicago,1415286,NaN,NaN

In [32]:
events1.merge(
    right = events2,
    how = "outer", 
    on = "group_id", 
    indicator = True
)

,event_id_x,event_name_x,group_id,event_id_y,event_name_y,_merge
0,153868222,Murder Mystery Dinner Crawl. Dine at 3 Restaur...,5817262,qrwlqhytcbcc,Drinks with International Travelers,both
1,220826782,Friday Night Drinks,5817262,qrwlqhytcbcc,Drinks with International Travelers,both
2,227967930,AUSTRALIA DAY PARTY & Sausage Sizzle! $3 Beer/...,5817262,qrwlqhytcbcc,Drinks with International Travelers,both
3,230034070,"Dinner, Comedy Show, 100 Beers & Debauchery!",5817262,qrwlqhytcbcc,Drinks with International Travelers,both
4,184167702,Friday Night Drinks with International Travele...,1627081,kjmpllytpbfb,Murder Mystery Restaurant Crawl!,both
...,...,...,...,...,...,...
281052,NaN,NaN,18278889,zzsxdlyxjbxb,Chicago Realtor Mastermind Group,right_only
281053,NaN,NaN,18278889,zzsxdlyxkbvb,Chicago Realtor Mastermind Group,right_only
281054,NaN,NaN,18278889,zzsxdlyxlbbc,Chicago Realtor Mastermind Group,right_only
281055,NaN,NaN,18278889,zzsxdlyxmbwb,Chicago Realtor Mastermind Group,right_only
281056,NaN,NaN,18278889,zzsxdlyxnbtb,Chicago Realtor Mastermind Group,right_only

In [33]:
outer_join = events1.merge(
    right = events2,
    how = "outer",
    on = "group_id",
    indicator = True
)

in_left_only = outer_join["_merge"] == "left_only"

outer_join[in_left_only].head()

,event_id_x,event_name_x,group_id,event_id_y,event_name_y,_merge
8,233755101,The Founding Moms Exchange: Chicago,1415286,NaN,NaN,left_only
9,241206928,The Founding Moms' Exchange: Chicago,1415286,NaN,NaN,left_only
10,241206937,The Founding Moms' Exchange: Chicago,1415286,NaN,NaN,left_only
11,243650743,The Founding Moms' Exchange: Chicago!,1415286,NaN,NaN,left_only
12,244483624,The Founding Moms' Exchange: Chicago,1415286,NaN,NaN,left_only

## 10.5 Left and Right Joins

In [34]:
groups.head(1)

   group_id              group_name  category_id  city_id  organizer_id
0      6388  Alternative Health NYC           14    10001       1513133

In [35]:
groups.merge(
    right = categories, how = "left", on = "category_id"
).head()

,group_id,group_name,category_id,city_id,organizer_id,category_name
0,6388,Alternative Health NYC,14,10001,1513133,Health & Wellbeing
1,6510,Alternative Energy Meetup,4,10001,3955940,Community & Environment
2,8458,NYC Animal Rights,26,10001,1809940,NaN
3,8940,The New York City Anime Group,29,10001,2548151,Sci-Fi & Fantasy
4,10104,NYC Pit Bull Group,26,10001,1929168,NaN

## 10.6 The left_on and right_on Parameters

In [36]:
cities.head(2)

   city_id           city state    zip
0     7093  West New York    NJ   7093
1    10001       New York    NY  10001

In [37]:
cities.rename(
    columns = { "city_id": "city identifier" },
    inplace = True
)

cities.head(2)

   city identifier           city state    zip
0             7093  West New York    NJ   7093
1            10001       New York    NY  10001

In [38]:
groups.merge(
    cities,
    how = "left",
    left_on = "city_id",
    right_on = "city identifier"
).head()

,group_id,group_name,category_id,city_id,organizer_id,city identifier,city,state,zip
0,6388,Alternative Health NYC,14,10001,1513133,10001,New York,NY,10001
1,6510,Alternative Energy Meetup,4,10001,3955940,10001,New York,NY,10001
2,8458,NYC Animal Rights,26,10001,1809940,10001,New York,NY,10001
3,8940,The New York City Anime Group,29,10001,2548151,10001,New York,NY,10001
4,10104,NYC Pit Bull Group,26,10001,1929168,10001,New York,NY,10001

## 10.7 Merging on Index Labels

In [39]:
members1.set_index(keys = "member_id", inplace = True)
members1.head(2)

               member_name      city state
member_id
3              Matt Meeker  New York    NY
6          Scott Heiferman  New York    NY

In [40]:
groups.head(2)

   group_id                 group_name  category_id  city_id  organizer_id
0      6388     Alternative Health NYC           14    10001       1513133
1      6510  Alternative Energy Meetup            4    10001       3955940

In [41]:
groups.merge(
    right = members1,
    how = "left",
    left_on = "organizer_id",
    right_index = True
).head()

,group_id,group_name,category_id,city_id,organizer_id,member_name,city,state
0,6388,Alternative Health NYC,14,10001,1513133,Joel E.,New York,NY
1,6510,Alternative Energy Meetup,4,10001,3955940,Yair Greenbaum,New York,NY
2,8458,NYC Animal Rights,26,10001,1809940,Santos,New York,NY
3,8940,The New York City Anime Group,29,10001,2548151,Al Mejias,New York,NY
4,10104,NYC Pit Bull Group,26,10001,1929168,Amy,New York,NY

## 10.8 Coding Challenge

In [42]:
pd.read_csv("restaurant/week_1_sales.csv").head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [43]:
week1 = pd.read_csv("restaurant/week_1_sales.csv")
week2 = pd.read_csv("restaurant/week_2_sales.csv")

In [44]:
pd.read_csv("restaurant/customers.csv", index_col = "ID").head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [45]:
customers = pd.read_csv(
    "restaurant/customers.csv", index_col = "ID"
)

In [46]:
pd.read_csv("restaurant/foods.csv", index_col = "Food ID")

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49
6             Pasta  13.99
7             Steak  24.99
8             Salad  11.25
9             Donut   0.99
10            Drink   1.75

In [47]:
foods = pd.read_csv("restaurant/foods.csv", index_col = "Food ID")

In [48]:
pd.concat(objs = [week1, week2], keys = ["Week 1", "Week 2"])

            Customer ID  Food ID
Week 1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
Week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]

In [49]:
week1.merge(
    right = week2, how = "inner", on = "Customer ID"
).head()

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8
4          503          5          9

In [50]:
week1.merge(
    right = week2, how = "inner", on = "Customer ID"
).drop_duplicates(subset = ["Customer ID"]).head()

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
3          503          5          8
5          550          6          7
6          101          7          4

In [51]:
week1.merge(
    right = week2,
    how = "inner",
    on = ["Customer ID", "Food ID"]
)

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [52]:
week1.merge(
    right = week2,
    how = "outer",
    on = "Customer ID",
    indicator = True
).head()

   Customer ID  Food ID_x  Food ID_y     _merge
0          537        9.0        5.0       both
1           97        4.0        NaN  left_only
2          658        1.0        NaN  left_only
3          202        2.0        NaN  left_only
4          155        9.0        3.0       both

In [53]:
week1.merge(
    right = customers,
    how = "left",
    left_on = "Customer ID",
    right_index = True
).head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III

## 10.9 Summary